uhnp/src/Enums/ПричиныИзмененияСведенийККТ/ПричиныИзмененияСведенийККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСведенийККТ</name>
  <enumValues>
    <name>ЗаменаФН</name>
    <comment>Замена фискального накопителя</comment>
  </enumValues>
  <enumValues>
    <name>ЗаменаОФД</name>
    <comment>Замена оператора фискальных данных</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеНаименованияПользователя</name>
    <comment>Изменение наименования пользователя контрольно-кассовой техники</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеАдреса</name>
    <comment>Изменение адреса и (или) места установки (применения) контрольно-кассовой техники</comment>
  </enumValues>
  <enumValues>
    <name>ПереводВРежимПередачиДанных</name>
    <comment>Перевод ККТ из автономного режима в режим передачи данных</comment>
  </enumValues>
  <enumValues>
    <name>ПереводВАвтономныйРежим</name>
    <comment>Перевод ККТ из режима передачи данных в автономный режим</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеВерсии</name>
    <comment>Изменение версии модели ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеСистемНалогообложения</name>
    <comment>Изменение перечня систем налогообложения, применяемых при осуществлении расчетов</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеНомераУстройства</name>
    <comment>Изменение номера автоматического устройства для расчетов, в составе которого применяется ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ПереводВНеавтоматическийРежим</name>
    <comment>Перевод ККТ из автоматического режима в неавтоматический режим (осуществление расчетов кассиром)</comment>
  </enumValues>
  <enumValues>
    <name>ПереводВАвтоматическийРежим</name>
    <comment>Перевод ККТ из неавтоматического режима (осуществление расчетов кассиром) в автоматический режим</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеБСО</name>
    <comment>Перевод ККТ из режима, не позволяющего формировать БСО, в режим, позволяющий формировать БСО</comment>
  </enumValues>
  <enumValues>
    <name>ВыключениеБСО</name>
    <comment>Перевод ККТ из режима, позволяющего формировать БСО, в режим, не позволяющий формировать БСО</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеРежимаРасчетовВИнтернет</name>
    <comment>Перевод ККТ в режим расчетов в сети Интернет</comment>
  </enumValues>
  <enumValues>
    <name>ВыключениеРежимаРасчетовВИнтернет</name>
    <comment>Перевод ККТ из режима расчетов в сети Интернет</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеРежимаАгента</name>
    <comment>Перевод ККТ из режима, не позволяющего оказывать услуги платежного агента (субагента) или банковского платежного агента в режим, позволяющий оказывать услуги платежного агента (субагента) или банковского платежного агента</comment>
  </enumValues>
  <enumValues>
    <name>ВыключениеРежимаАгента</name>
    <comment>Перевод ККТ из режима, позволяющего оказывать услуги платежного агента (субагента) или банковского платежного агента, в режим, не позволяющий оказывать услуги платежного агента (субагента) или банковского платежного агента</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеРежимаАзартныхИгр</name>
    <comment>Перевод ККТ из режима, не позволяющего применять ККТ при приеме ставок и выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению азартных игр, в режим, позволяющий применять ККТ при приеме ставок и выплате денеж</comment>
  </enumValues>
  <enumValues>
    <name>ВыключениеРежимаАзартныхИгр</name>
    <comment>Перевод ККТ из режима, позволяющего применять ККТ при приеме ставок и выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению азартных игр, в режим, не позволяющий применять ККТ при приеме ставок и выплате денеж</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеРежимаЛотереи</name>
    <comment>Перевод ККТ из режима, не позволяющего применять ККТ при приеме денежных средств при реализации лотерейных билетов, электронных лотерейных билетов, приеме лотерейных ставок и выплате денежных средств в виде выигрыша при осуществлении деятельности по орган</comment>
  </enumValues>
  <enumValues>
    <name>ВыключениеРежимаЛотереи</name>
    <comment>Перевод ККТ из режима, позволяющего применять ККТ при приеме денежных средств при реализации лотерейных билетов, электронных лотерейных билетов, приеме лотерейных ставок и выплате денежных средств в виде выигрыша при осуществлении деятельности по организа</comment>
  </enumValues>
  <enumValues>
    <name>ИзменениеВерсииФФД</name>
    <comment>Изменение версии ФФД</comment>
  </enumValues>
  <enumValues>
    <name>Иное</name>
    <comment>Иные причины</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПризнакиАгента/ПризнакиАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиАгента</name>
  <enumValues>
    <name>БанковскийПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>Поверенный</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся поверенным</comment>
  </enumValues>
  <enumValues>
    <name>Комиссионер</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся комиссионером</comment>
  </enumValues>
  <enumValues>
    <name>Агент</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся агентом и не являющимся банковским платежным агентом (субагентом), платежным агентом (субагентом), поверенным, комиссионером</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

#Область КодыОФД

///////////////////////////////////////////////////////////////////////////////
// Коды изменений сведений ККТ

// Возвращает код причины изменения сведений о ККТ.
// 
// Параметры:
//  ПричинаИзмененияСведенийККТ - ПеречислениеСсылка.ПричиныИзмененияСведенийККТ - Причина изменения сведений ККТ.
// 
// Возвращаемое значение:
//  Произвольный, Число - Код причины изменения сведений ККТ
Функция КодПричиныИзмененияСведенийККТ(ПричинаИзмененияСведенийККТ) Экспорт
	
	ПричиныИзмененияСведенийККТ = Новый Соответствие(); 
	
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ЗаменаФН")                         , 0);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ЗаменаОФД")                        , 1);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеНаименованияПользователя"), 2);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеАдреса")                  , 3);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ПереводВРежимПередачиДанных")      , 4);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ПереводВАвтономныйРежим")          , 5);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеВерсии")                  , 6);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеСистемНалогообложения")   , 7);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеНомераУстройства")        , 8);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ПереводВНеавтоматическийРежим")    , 9);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ПереводВАвтоматическийРежим")      , 10);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВключениеБСО")                     , 11);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВыключениеБСО")                    , 12);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВключениеРежимаРасчетовВИнтернет") , 13);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВыключениеРежимаРасчетовВИнтернет"), 14);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВключениеРежимаАгента")            , 15);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВыключениеРежимаАгента")           , 16);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВключениеРежимаАзартныхИгр")       , 17);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВыключениеРежимаАзартныхИгр")      , 18);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВключениеРежимаЛотереи")           , 19);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ВыключениеРежимаЛотереи")          , 20);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.ИзменениеВерсииФФД")               , 21);
	ПричиныИзмененияСведенийККТ.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныИзмененияСведенийККТ.Иное")                             , 31);
	
	Возврат ПричиныИзмененияСведенийККТ.Получить(ПричинаИзмененияСведенийККТ);
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Коды признаков агентов

// Возвращает признак агента по коду.
// 
// Параметры:
//  КодПризнакаАгента - ПеречислениеСсылка.ПризнакиАгента - Код признака агента
// 
// Возвращаемое значение:
//  Произвольный, Число - Код признака агента
Функция КодПризнакаАгента(КодПризнакаАгента) Экспорт
	
	ПризнакиАгента = Новый Соответствие(); 
	
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйАгент")   , 0);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйСубагент"), 1);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйАгент")             , 2);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйСубагент")          , 3);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Поверенный")                 , 4);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Комиссионер")                , 5);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Агент")                      , 6);
	
	Возврат ПризнакиАгента.Получить(КодПризнакаАгента);
	
КонецФункции

// Возвращает код типа признака агента.
// 
// Параметры:
//  ПризнакАгента - Число - Признак агента
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ПризнакиАгента, Произвольный - Признак агента по коду
Функция ПризнакАгентаПоКоду(ПризнакАгента) Экспорт
	
	ПризнакиАгента = Новый Соответствие(); 
	
	ПризнакиАгента.Вставить(0, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйАгент"));
	ПризнакиАгента.Вставить(1, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйСубагент"));
	ПризнакиАгента.Вставить(2, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйАгент"));
	ПризнакиАгента.Вставить(3, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйСубагент"));
	ПризнакиАгента.Вставить(4, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Поверенный"));
	ПризнакиАгента.Вставить(5, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Комиссионер"));
	ПризнакиАгента.Вставить(6, ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Агент"));
	
	Возврат ПризнакиАгента.Получить(ПризнакАгента);
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Коды единицы измерения

// Возвращает код меры количества предмета расчета ККТ.
// 
// Параметры:
//  МераКоличестваПредметаРасчетаККТ - ПеречислениеСсылка.МераКоличестваПредметаРасчетаККТ - Мера количества предмета расчета ККТ
// 
// Возвращаемое значение:
//  Произвольный, Число - Код меры количества предмета расчета ККТ     
Функция КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчетаККТ) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Возврат ОборудованиеЧекопечатающиеУстройства.
		КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчетаККТ);
#Иначе
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиент.
		КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчетаККТ);
#КонецЕсли
	
КонецФункции

// Возвращает меру количества предмета расчета по коду.
// 
// Параметры:
//  КодМерыКоличестваПредметаРасчетаККТ - ПеречислениеСсылка.МераКоличестваПредметаРасчетаККТ - Код меры количества предмета расчета ККТ
// 
// Возвращаемое значение:                                                                                    
//  Произвольный, ПеречислениеСсылка.МераКоличестваПредметаРасчетаККТ - Мера количества предмета расчета ККТ по коду        
//
Функция МераКоличестваПредметаРасчетаККТПоКоду(КодМерыКоличестваПредметаРасчетаККТ) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Возврат ОборудованиеЧекопечатающиеУстройства.
		МераКоличестваПредметаРасчетаККТПоКоду(КодМерыКоличестваПредметаРасчетаККТ);
#Иначе
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиент.
		МераКоличестваПредметаРасчетаККТПоКоду(КодМерыКоличестваПредметаРасчетаККТ);
#КонецЕсли
	
КонецФункции

// Возвращает меру количества предмета расчета по коду единицы измерения.
// 
// Параметры:
//  КодЕдиницыИзмерения - Число - Код единицы измерения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.МераКоличестваПредметаРасчетаККТ, Произвольный - Мера количества предмета расчета по коду единицы измерения
Функция МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(КодЕдиницыИзмерения) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Возврат ОборудованиеЧекопечатающиеУстройства.
		МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(КодЕдиницыИзмерения);
#Иначе
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиент.
		МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(КодЕдиницыИзмерения);
#КонецЕсли
	
КонецФункции

// Возвращает код единицы измерения по ККТ коду.
// 
// Параметры:
//  КодМерыКоличестваПредметаРасчетаККТ - Число - Код меры количества предмета расчета ККТ.
// 
// Возвращаемое значение:
//  Строка
//
Функция КодЕдиницыИзмеренияПоККТКоду(КодМерыКоличестваПредметаРасчетаККТ) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Возврат ОборудованиеЧекопечатающиеУстройства.
		КодЕдиницыИзмеренияПоККТКоду(КодМерыКоличестваПредметаРасчетаККТ);
#Иначе
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиент.
		КодЕдиницыИзмеренияПоККТКоду(КодМерыКоличестваПредметаРасчетаККТ);
#КонецЕсли
	
КонецФункции

#КонецОбласти

#КонецОбласти
